name: "onnx-lenet"
platform: "onnxruntime_onnx"
max_batch_size: 4

input [
    {
        name: "IMAGES"
        data_type: TYPE_FP32
        dims: [ 3, 224, 224 ]
    }
]

output [
    {
        name: "CLASS_PROBS"
        data_type: TYPE_FP32
        dims: [ 4 ]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]

dynamic_batching: { max_queue_delay_microseconds: 4000 }
