name: "ensemble-onnx"
platform: "ensemble"

input [
    {
        name: "INPUT_IMAGES"
        data_type: TYPE_INT8
        dims: [ -1, -1, 3 ]
    }
]

output [
    {
        name: "CLASS_PROBS"
        data_type: TYPE_FP32
        dims: [ 4 ]
    }
]

ensemble_scheduling {
    step [
        {
            model_name: "python-transform"
            model_version: -1
            input_map {
                key: "INPUT_IMAGES"
                value: "INPUT_IMAGES"
            }

            output_map {
                key: "IMAGES"
                value: "IMAGES"
            }
        },
        {
            model_name: "onnx-lenet"
            model_version: -1
            input_map {
                key: "IMAGES"
                value: "IMAGES"
            }
            output_map {
                key: "CLASS_PROBS"
                value: "CLASS_PROBS"
            }
        }
    ]
}
