name: "python-transform"
platform: "python"
max_batch_size: 0

input [
    {
        name: "IMAGES"
        data_type: TYPE_INT8
        dims: [ -1, -1, 3 ]
    }
]

output [
    {
        name: "IMAGES"
        data_type: TYPE_FP32
        dims: [ 3, 224, 224 ]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]
